In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 32, 23, 45],
    'Score': [88, 92, 85, 95]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
print("Original DataFrame:")
print(df)

Original DataFrame:
      Name  Age  Score
0    Alice   25     88
1      Bob   32     92
2  Charlie   23     85
3    David   45     95

In [6]:
customers_data = pd.read_csv("C:/Users/Dell/Desktop/Python/Python Data Analytics/datasets/Customers_Data.csv", encoding='ISO-8859-1')
print(customers_data.head())

   CustomerKey Prefix  FirstName LastName  BirthDate MaritalStatus Gender  \
0        11000    MR.        JON     YANG   4/8/1966             M      M
1        11001    MR.     EUGENE    HUANG  5/14/1965             S      M
2        11002    MR.      RUBEN   TORRES  8/12/1965             M      M
3        11003    MS.    CHRISTY      ZHU  2/15/1968             S      F
4        11004   MRS.  ELIZABETH  JOHNSON   8/8/1968             S      F

                     EmailAddress AnnualIncome  TotalChildren EducationLevel  \
0       jon24@adventure-works.com     $90,000               2      Bachelors
1    eugene10@adventure-works.com     $60,000               3      Bachelors
2     ruben35@adventure-works.com     $60,000               3      Bachelors
3   christy12@adventure-works.com     $70,000               0      Bachelors
4  elizabeth5@adventure-works.com     $80,000               5      Bachelors

     Occupation HomeOwner
0  Professional         Y
1  Professional         N
2  Professional         Y
3  Professional         N
4  Professional         Y

In [7]:
expesne_data = pd.read_excel("C:/Users/Dell/Desktop/Python/Python Data Analytics/datasets/ESD.xlsx")
print(expesne_data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [8]:
print(expesne_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [9]:
expesne_data.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

In [10]:
expesne_data.isnull().sum()

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

In [11]:
company_data = pd.read_csv("C:/Users/Dell/Desktop/Python/Python Data Analytics/datasets/company1.csv")
df = pd.DataFrame(company_data)
print(company_data.head())

    EEID First Name Last Name gender   salary
0  EMP01     ayushi      khan      F      NaN
1  EMP02      rohit      khan      M  25000.0
2  EMP03   pranjali      khan    NaN  27000.0
3  EMP01     ayushi      khan      F  20000.0
4  EMP05        NaN      khan      M  25000.0

In [12]:
print(company_data["EEID"].duplicated().sum())

2

In [13]:
df_unique = df.drop_duplicates(subset="EEID")
print(df_unique)

    EEID First Name Last Name gender   salary
0  EMP01     ayushi      khan      F      NaN
1  EMP02      rohit      khan      M  25000.0
2  EMP03   pranjali      khan    NaN  27000.0
4  EMP05        NaN      khan      M  25000.0
5  EMP06      rohit      khan      M      NaN

In [14]:
company_data.isnull().sum()

EEID          0
First Name    1
Last Name     0
gender        1
salary        2
dtype: int64

In [15]:
print(company_data.dropna())

    EEID First Name Last Name gender   salary
1  EMP02      rohit      khan      M  25000.0
3  EMP01     ayushi      khan      F  20000.0
6  EMP02      rohit      khan      M  25000.0

In [16]:
print(company_data)
print(company_data["salary"].mean())

    EEID First Name Last Name gender   salary
0  EMP01     ayushi      khan      F      NaN
1  EMP02      rohit      khan      M  25000.0
2  EMP03   pranjali      khan    NaN  27000.0
3  EMP01     ayushi      khan      F  20000.0
4  EMP05        NaN      khan      M  25000.0
5  EMP06      rohit      khan      M      NaN
6  EMP02      rohit      khan      M  25000.0
24400.0

In [17]:
import numpy as np
print(company_data.replace(np.nan,30000))

    EEID First Name Last Name gender   salary
0  EMP01     ayushi      khan      F  30000.0
1  EMP02      rohit      khan      M  25000.0
2  EMP03   pranjali      khan  30000  27000.0
3  EMP01     ayushi      khan      F  20000.0
4  EMP05      30000      khan      M  25000.0
5  EMP06      rohit      khan      M  30000.0
6  EMP02      rohit      khan      M  25000.0

In [18]:
company_data["salary"]   = company_data["salary"].replace(np.nan,26000)
print(company_data)

    EEID First Name Last Name gender   salary
0  EMP01     ayushi      khan      F  26000.0
1  EMP02      rohit      khan      M  25000.0
2  EMP03   pranjali      khan    NaN  27000.0
3  EMP01     ayushi      khan      F  20000.0
4  EMP05        NaN      khan      M  25000.0
5  EMP06      rohit      khan      M  26000.0
6  EMP02      rohit      khan      M  25000.0

In [19]:
print(company_data["salary"].mean())

24857.14285714286

In [20]:
print(company_data.ffill())

    EEID First Name Last Name gender   salary
0  EMP01     ayushi      khan      F  26000.0
1  EMP02      rohit      khan      M  25000.0
2  EMP03   pranjali      khan      M  27000.0
3  EMP01     ayushi      khan      F  20000.0
4  EMP05     ayushi      khan      M  25000.0
5  EMP06      rohit      khan      M  26000.0
6  EMP02      rohit      khan      M  25000.0

In [21]:
print(expesne_data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [22]:
expesne_data.loc[expesne_data["Bonus %"] == 0, "GetsBonus"] = "no bonus"
expesne_data.loc[expesne_data["Bonus %"] > 0, "GetsBonus"] = "bonus"
print(expesne_data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date GetsBonus
0     0.15  United States    Seattle 2021-10-16     bonus
1     0.00          China  Chongqing        NaT  no bonus
2     0.20  United States    Chicago        NaT     bonus
3     0.07  United States    Chicago        NaT     bonus
4     0.00  United States    Phoenix        NaT  no bonus
5     0.00          China  Chongqing        NaT  no bonus
6     0.10  United States    Phoenix        NaT     bonus
7     0.00  United States      Miami 2021-05-20  no bonus
8     0.06  United States     Austin        NaT     bonus
9     0.00  United States    Chicago        NaT  no bonus

In [23]:
count_no_bonus = expesne_data[expesne_data["GetsBonus"] == "no bonus"].shape[0]
print(f"Number of employees with no bonus: {count_no_bonus}")

Number of employees with no bonus: 525

In [24]:
company_data["Full Name"] = company_data["First Name"].str.capitalize() +" "+company_data["Last Name"].str.capitalize()
print(company_data)

    EEID First Name Last Name gender   salary      Full Name
0  EMP01     ayushi      khan      F  26000.0    Ayushi Khan
1  EMP02      rohit      khan      M  25000.0     Rohit Khan
2  EMP03   pranjali      khan    NaN  27000.0  Pranjali Khan
3  EMP01     ayushi      khan      F  20000.0    Ayushi Khan
4  EMP05        NaN      khan      M  25000.0            NaN
5  EMP06      rohit      khan      M  26000.0     Rohit Khan
6  EMP02      rohit      khan      M  25000.0     Rohit Khan

In [25]:
# Print the first few rows of the data
print(company_data.head())

# Check for duplicated EEIDs
print(company_data["EEID"].duplicated().sum())

# Drop duplicates based on the EEID column
company_data = company_data.drop_duplicates(subset="EEID")

# Print the updated DataFrame
print(company_data)

    EEID First Name Last Name gender   salary      Full Name
0  EMP01     ayushi      khan      F  26000.0    Ayushi Khan
1  EMP02      rohit      khan      M  25000.0     Rohit Khan
2  EMP03   pranjali      khan    NaN  27000.0  Pranjali Khan
3  EMP01     ayushi      khan      F  20000.0    Ayushi Khan
4  EMP05        NaN      khan      M  25000.0            NaN
2
    EEID First Name Last Name gender   salary      Full Name
0  EMP01     ayushi      khan      F  26000.0    Ayushi Khan
1  EMP02      rohit      khan      M  25000.0     Rohit Khan
2  EMP03   pranjali      khan    NaN  27000.0  Pranjali Khan
4  EMP05        NaN      khan      M  25000.0            NaN
5  EMP06      rohit      khan      M  26000.0     Rohit Khan

In [26]:
company_data["Bonus"] = (company_data["salary"]/100)*20
print(company_data)

    EEID First Name Last Name gender   salary      Full Name   Bonus
0  EMP01     ayushi      khan      F  26000.0    Ayushi Khan  5200.0
1  EMP02      rohit      khan      M  25000.0     Rohit Khan  5000.0
2  EMP03   pranjali      khan    NaN  27000.0  Pranjali Khan  5400.0
4  EMP05        NaN      khan      M  25000.0            NaN  5000.0
5  EMP06      rohit      khan      M  26000.0     Rohit Khan  5200.0

In [27]:
import pandas as pd

# Define the data with months
data = {"Months": ["January", "February", "March", "April", "May", "June", 
                   "July", "August", "September", "October", "November", "December"]}

# Create a DataFrame from the data
a = pd.DataFrame(data)
print(a)

# Function to extract the first three characters from each month
def extract(value):
    return value[0:3]

# Apply the 'extract' function to the 'Months' column and create a new column 'Short_months'
a["Short_months"] = a["Months"].map(extract)

# Print the DataFrame with the new column
print(a)

       Months
0     January
1    February
2       March
3       April
4         May
5        June
6        July
7      August
8   September
9     October
10   November
11   December
       Months Short_months
0     January          Jan
1    February          Feb
2       March          Mar
3       April          Apr
4         May          May
5        June          Jun
6        July          Jul
7      August          Aug
8   September          Sep
9     October          Oct
10   November          Nov
11   December          Dec

In [28]:
print(expesne_data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date GetsBonus
0       0.15  United States    Seattle 2021-10-16     bonus
1       0.00          China  Chongqing        NaT  no bonus
2       0.20  United States    Chicago        NaT     bonus
3       0.07  United States    Chicago        NaT     bonus
4       0.00  United States    Phoenix        NaT  no bonus
..       ...            ...        ...        ...       ...
995     0.00  United States   Columbus        NaT  no bonus
996     0.00          China    Chengdu 2018-01-08  no bonus
997     0.15  United States      Miami        NaT     bonus
998     0.00          China    Chengdu        NaT  no bonus
999     0.31  United States      Miami        NaT     bonus

[1000 rows x 15 columns]

In [33]:
gp = expesne_data.groupby(["Job Title","Gender"]).agg({"EEID":"count"})
print(gp)

                               EEID
Job Title              Gender
Account Representative Female    15
                       Male       6
Analyst                Female    31
                       Male      20
Analyst II             Female    21
...                             ...
Technical Architect    Male       8
Test Engineer          Female     7
                       Male       5
Vice President         Female    50
                       Male      55

[66 rows x 1 columns]

In [40]:
gp1 = expesne_data.groupby(["Department","Gender"]).agg({"Gender":"count"})
print(gp1)

                        Gender
Department      Gender
Accounting      Female      53
                Male        43
Engineering     Female      80
                Male        78
Finance         Female      69
                Male        51
Human Resources Female      64
                Male        61
IT              Female     119
                Male       122
Marketing       Female      57
                Male        63
Sales           Female      76
                Male        64

In [41]:
gp2 = expesne_data.groupby("Country").agg({"Annual Salary":"max","Age":"min"})
print(gp2)

               Annual Salary  Age
Country
Brazil                258426   25
China                 257194   25
United States         258498   25

In [47]:
import pandas as pd

# Create two datasets
data1 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05", "E06","E07"],
    "Names": ["Ahmed", "Hassan", "Aisha", "Fatima", "Omar", "Zainab","saad"],
    "Age": [34, 56, 23, 44, 32, 29,30]
}

data2 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05", "E06"],
    "Salary": [45000, 56000, 34000, 30000, 50000, 47000]
}

# Convert dictionaries to DataFrames
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

# Print the first DataFrame
print(df1)
print()

# Print the second DataFrame
print(df2)

  Emp Id   Names  Age
0    E01   Ahmed   34
1    E02  Hassan   56
2    E03   Aisha   23
3    E04  Fatima   44
4    E05    Omar   32
5    E06  Zainab   29
6    E07    saad   30

  Emp Id  Salary
0    E01   45000
1    E02   56000
2    E03   34000
3    E04   30000
4    E05   50000
5    E06   47000

In [48]:
print(pd.merge(df1,df2,on = "Emp Id", how = "left")) #by default it used the lower join

  Emp Id   Names  Age   Salary
0    E01   Ahmed   34  45000.0
1    E02  Hassan   56  56000.0
2    E03   Aisha   23  34000.0
3    E04  Fatima   44  30000.0
4    E05    Omar   32  50000.0
5    E06  Zainab   29  47000.0
6    E07    saad   30      NaN

In [50]:
import pandas as pd

# First DataFrame with car details
data1 = {
    'Car Model': ['A', 'B', 'C', 'D', 'E'],
    'Speed': [70, 75, 80, 85, 90],
    'Fuel Efficiency': [30, 28, 27, 25, 23]
}

# Second DataFrame with more car details
data2 = {
    'Car Model': ['F', 'G', 'H', 'I', 'J'],
    'Speed': [95, 100, 105, 110, 115],
    'Fuel Efficiency': [22, 21, 20, 19, 18]
}

# Create DataFrames
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print(df2)

# Concatenate row-wise (default is axis=0)
df_concat = pd.concat([df1, df2])

# Print the concatenated DataFrame
print(df_concat)

  Car Model  Speed  Fuel Efficiency
0         A     70               30
1         B     75               28
2         C     80               27
3         D     85               25
4         E     90               23
  Car Model  Speed  Fuel Efficiency
0         F     95               22
1         G    100               21
2         H    105               20
3         I    110               19
4         J    115               18
  Car Model  Speed  Fuel Efficiency
0         A     70               30
1         B     75               28
2         C     80               27
3         D     85               25
4         E     90               23
0         F     95               22
1         G    100               21
2         H    105               20
3         I    110               19
4         J    115               18

In [51]:
import pandas as pd

# Create a dictionary of fruits data
data = {
    "Fruits": ["mango", "apples", "banana", "papaya"],
    "Price": [100, 150, 50, 35],
    "Quantity": [15, 10, 10, 3]
}

# Create DataFrame from the dictionary
df1 = pd.DataFrame(data)
print(df1)

# Create a copy of the DataFrame
df2 = df1.copy()

# Modify values in df2
df2.loc[0, "Price"] = 120
df2.loc[1, "Price"] = 175
df2.loc[3, "Price"] = 30

df2.loc[0, "Quantity"] = 12
df2.loc[1, "Quantity"] = 1
df2.loc[3, "Quantity"] = 30

# Print both DataFrames to see the differences
print("\nOriginal DataFrame (df1):")
print(df1)

print("\nModified DataFrame (df2):")
print(df2)

   Fruits  Price  Quantity
0   mango    100        15
1  apples    150        10
2  banana     50        10
3  papaya     35         3

Original DataFrame (df1):
   Fruits  Price  Quantity
0   mango    100        15
1  apples    150        10
2  banana     50        10
3  papaya     35         3

Modified DataFrame (df2):
   Fruits  Price  Quantity
0   mango    120        12
1  apples    175         1
2  banana     50        10
3  papaya     30        30

In [53]:
print(df1.compare(df2, align_axis=0))

         Price  Quantity
0 self   100.0      15.0
  other  120.0      12.0
1 self   150.0      10.0
  other  175.0       1.0
3 self    35.0       3.0
  other   30.0      30.0

In [57]:
import pandas as pd

# Create a dictionary of data
data = {
    "keys": ["k1", "k2", "k1", "k2"],
    "Names": ["John", "Ben", "David", "Peter"],
    "Houses": ["red", "blue", "green", "red"],
    "Grades": ["A", "B", "C", "A"]
}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

# Use pivot to reshape the DataFrame for Houses
pivoted_houses = df.pivot(index="keys", columns="Names", values="Houses")

# Use pivot to reshape the DataFrame for Grades
pivoted_grades = df.pivot(index="keys", columns="Names", values="Grades")

# Print the pivoted DataFrames
print("\nPivoted DataFrame (Houses):")
print(pivoted_houses)

print("\nPivoted DataFrame (Grades):")
print(pivoted_grades)

# Combine the two pivoted DataFrames (Houses and Grades)
combined = pd.concat([pivoted_houses, pivoted_grades], keys=['Houses', 'Grades'])

# Print the combined pivoted DataFrame
print("\nCombined DataFrame (Houses and Grades):")
print(combined)

Original DataFrame:
  keys  Names Houses Grades
0   k1   John    red      A
1   k2    Ben   blue      B
2   k1  David  green      C
3   k2  Peter    red      A

Pivoted DataFrame (Houses):
Names   Ben  David John Peter
keys
k1      NaN  green  red   NaN
k2     blue    NaN  NaN   red

Pivoted DataFrame (Grades):
Names  Ben David John Peter
keys
k1     NaN     C    A   NaN
k2       B   NaN  NaN     A

Combined DataFrame (Houses and Grades):
Names         Ben  David John Peter
       keys
Houses k1     NaN  green  red   NaN
       k2    blue    NaN  NaN   red
Grades k1     NaN      C    A   NaN
       k2       B    NaN  NaN     A